# SetPosition Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarBendingDetail..::..SetPosition Method
RebarBendingDetail Class See Also
---
Sets the position for this bending detail relative to its view.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static void SetPosition(
	Element bendingDetail,
	XYZ position
)
```

Visual Basic
---
```text
Public Shared Sub SetPosition ( _
	bendingDetail As Element, _
	position As XYZ _
)
```

Visual C++
---
```text
public:
static void SetPosition(
	Element^ bendingDetail,
	XYZ^ position
)
```

# ### Parameters
bendingDetail
    Type: Autodesk.Revit.DB..::..Element The bending detail for which we want to get the position.
position
    Type: Autodesk.Revit.DB..::..XYZ The new position for this bending detail relative to its view.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RebarBendingDetail Class
Autodesk.Revit.DB.Structure Namespace